[
  "Computers make very fast, very accurate mistakes.",
  ".NET is called .NET so that it wouldn't show up in a UNIX directory listing.",
  "One: Demonstrations always crash. And two: The probability of them crashing goes up exponentially with the number of people watching.",
  "The function of good software is to make the complex appear to be simple. - Grady Booch",
  "There is no Ctrl-Z in life.",
  "The computer was born to solve problems that did not exist before.",
  "Old programmers never die. They simply lose their memory.",
  "Artificial Intelligence usually beats real stupidity.",
  "Vim: The only editor that's also a game of 'How do I exit this thing?'",
  "Knock, knock … Who's there? … *very long pause* … Java.",
  "Why did the React component go to therapy? It had too many issues with its state.",
  "A primary cause of complexity is that software vendors uncritically adopt almost any feature that users want. - Niklaus Wirth",
  "Git push --force: Because sometimes, history is better rewritten.",
  "I told my computer I needed a break, and now it won't stop sending me Java updates.",
  "Without requirements or design, programming is the art of adding bugs to an empty text file. - Louis Srygley",
  "God is real … unless declared integer.",
  "Programming isn't about what you know; it's about what you can figure out. - Chris Pine",
  "Optimism is an occupational hazard of programming; feedback is the treatment.",
  "Walking on water and developing software from a specification are easy if both are frozen. - Edward V Berard",
  "One of the main causes of the fall of the Roman Empire was that lacking zero, they had no way to indicate successful termination of their C programs.",
  "The only way to go fast, is to go well. - Robert C. Martin",
  "Vim users don't search for text, the text finds them.",
  "Walkthrough: A meeting where computer code is verbally described in excruciating detail while onlookers become increasingly inattentive.",
  "Before software can be reusable, it first has to be usable. - Ralph Johnson",
  "I have always wished that my computer would be as easy to use as my telephone. My wish has come true. I no longer know how to use my telephone.",
  "Debugging is twice as hard as writing the code in the first place. Therefore, if you write the code as cleverly as possible, you are, by definition, not smart enough to debug it. - Brian W. Kernighan",
  "Chuck Norris can unit test entire applications with a single assert.",
  "Without C we only have Obol, Pasal, and BASI.",
  "Software and cathedrals are much the same — first we build them, then we pray.",
  "Programmer's partner: \"Are you going to sit and type in front of that thing all day, or are you going out with me?\" Programmer: \"Yes.\"",
  "A programmer's wife tells him, 'While you're at the store, get some milk.' He never comes back.",
  "Why did the programmer quit his job? Because he didn't get arrays (a raise).",
  "If at first, you don't succeed, call it version 1.0.",
  "Vim users don't use IDEs, they ARE the IDE.",
  "Remember that there is no code faster than no code.",
  "It works on my machine.",
  "Documentation is like sex: When it is bad, it is better than nothing. When it is good, it is really, really good.",
  "The most disastrous thing that you can ever learn is your first programming language. - Alan Kay",
  "Real programmers don't comment their code. If it was hard to write, it should be hard to understand.",
  "Deleted code is debugged code. - Jeff Sickel",
  "It's OK to figure out murder mysteries, but you shouldn't need to figure out code. You should be able to read it. - Steve McConnell",
  "A program is never less than 90% complete and never more than 95% complete. - Tom Cargill",
  "I have not failed. I've just found 10,000 ways that won't work.",
  "Why did the React component feel lonely? It had no props.",
  "You can have the project: done on time, on budget, or done right. Pick two. - Anonymous",
  "JavaScript logic: 0 == \"0\" and 0 == []; therefore, \"0\" != []",
  "Sometimes it pays to stay in bed on Monday, rather than spending the rest of the week debugging Monday's code. - Christopher Thompson",
  "One of my most productive days was throwing away 1,000 lines of code. - Ken Thompson",
  "Less code equals less bugs. - Kevlin Henney",
  "Programming is like sex: one mistake and you have to support it for the rest of your life.",
  "Docker: Ensuring it works on more than just the developer's machine.",
  "Russian roulette: [ $[ $RANDOM",
  "Why don't programmers like nature? Too many bugs.",
  "Vim users never exit... they just :q!",
  "Good design adds value faster than it adds cost. - Thomas C. Gale",
  "In C we had to code our own bugs. In C++ we can inherit them.",
  "Talk is cheap. Show me the code. - Linus Torvalds",
  "React: Making the web reactive since before it was cool.",
  "System programmers are the high priests of a low cult.",
  "AI doesn't make mistakes. It just finds creative new ways to interpret your instructions.",
  "How many programmers does it take to change a light bulb? None, that's a hardware problem.",
  "A system administrator has two problems: 1. Dumb users. 2. Smart users.",
  "C++: Where your friends have access to your private members.",
  "Controlling complexity is the essence of computer programming. - Brian Kernighan",
  "There's no 'CTRL' button on Chuck Norris's keyboard. Chuck Norris is always in control.",
  "React: Because manipulating the DOM yourself is so 2015.",
  "Linux is only free if your time has no value.",
  "In a room full of top software designers, if two agree on the same thing, that's a majority. - Bill Curtis",
  "Real programmers count from 0.",
  "The computer is incredibly fast, accurate, and stupid. Man is unbelievably slow, inaccurate, and brilliant. The marriage of the two is a force beyond calculation. - Leo Cherne",
  "Computers are good at following instructions but not at reading your mind.",
  "Simplicity is prerequisite for reliability. - Edsger Dijkstra",
  "COBOL programmers understand why women hate periods.",
  "C++: An octopus made by nailing extra legs onto a dog.",
  "Why did the Vim user cross the road? To get to the :other side.",
  "AI is like a Swiss Army knife: Versatile, but you wouldn't want to perform surgery with it.",
  "UNIX was not designed to stop people from doing stupid things, because that would also stop them from doing clever things.",
  "AI doesn't want to take your job. It just wants to do it better than you.",
  "I'm not interrupting you, I'm putting our conversation in async mode.",
  "React developers are always in a state of confusion.",
  "No code has zero defects.",
  "Machine learning is like teenage sex: Everyone talks about it, nobody really knows how to do it, everyone thinks everyone else is doing it, so everyone claims they are doing it.",
  "Debugging is like trying to find a needle in a haystack, except the needle is not in the haystack, but somewhere in the haystack factory.",
  "React developers don't have bugs, they have 'undefined behaviors.'",
  "Code is like a poem; it's not just something we write to reach some practical result. - Donald Knuth",
  "I've finally learned what upward compatible means. It means we get to keep all our old mistakes.",
  "When all else fails … reboot.",
  "If debugging is the process of removing bugs, then programming must be the process of putting them in. - Edsger Dijkstra",
  "React hooks are like fishing: You never know what state you'll catch.",
  "There's no obfuscated Perl contest because it's pointless.",
  "Chuck Norris's keyboard has two keys: 0 and 1.",
  "A son asked his father (a programmer) why the sun rises in the east, and sets in the west. His response? It works, don't touch!",
  "Machine learning is like raising a child. It takes a lot of training, and you're never sure what it'll do next.",
  "What's the object-oriented way to get wealthy? Inheritance.",
  "UNIX is user friendly. It's just very particular about who its friends are.",
  "Software testing is a sport like hunting, it's bughunting.",
  "AI doesn't replace jobs, it creates new ones... like 'AI Ethics Officer.'",
  "Hardware is made to last. Software is made to change. Change is the only thing that lasts. Software wins."
]